fix(session): clean autostart warnings
